// тут запуск действий

/** 
 * шлет цифры на дисплей ошибок
 * три двухзначных числа
 */
showEcn(int[] d){	ls.SendCANmessage(0x5e8,4,0x81,d[0], d[1], d[2]); 
}

/**
 * моргнуть задними аварийками два раза
 */
doThansk(){
	//уменьшить громкость на 1 обратно!
	ms.volumeDown(); // в магнитоле нет ЛС кана, так что на модуле без лс уменьшать громкость надо вручную 
	//код... 
	// не забыть, что нужно считать состояние всех фар!! если сообщение не сохраненно, то его получить..
	ls.SendCANmessage();
	delay();
}